app/models/listing.rb

  def self.all_locations
    self.pluck('city', 'country', 'state').uniq
---
SELECT "listings"."city", "listings"."country", "listings"."state" FROM "listings"